{
  "pageType": "Homepage",
  "title": "TNR Business Solutions | Digital Marketing & Insurance Services in Greensburg PA | Westmoreland County",
  "description": "Leading digital marketing agency and insurance services in Greensburg PA. Expert SEO, web design, social media marketing, and business insurance solutions for small businesses in Western Pennsylvania.",
  "mainHeading": "TNR Business Solutions",
  "subHeadings": [
    "Leading Digital Marketing Agency & Insurance Services in Greensburg, PA | Westmoreland County",
    "Digital Marketing & Insurance Services in Greensburg PA",
    "About TNR Business Solutions - Greensburg PA's Leading Digital Marketing & Insurance Agency",
    "Why Choose TNR Business Solutions for Digital Marketing & Insurance in Greensburg PA?",
    "Client Reviews",
    "Ready to Get Started?"
  ],
  "paragraphs": [
    "At TNR Business Solutions, we are your trusted local partner for comprehensive digital marketing, professional web design, and complete insurance protection services. We help small and medium-sized businesses in Greensburg, Pennsylvania and surrounding areas grow, protect, and thrive in today's competitive marketplace. Our integrated approach combines cutting-edge digital marketing strategies with comprehensive insurance solutions, ensuring your business scales confidently while safeguarding what matters most.",
    "Expert web design services in Greensburg PA. We create professional, mobile-friendly websites that drive conversions and boost your online presence for small businesses in Western Pennsylvania.",
    "Local SEO services in Westmoreland County. Our search engine optimization strategies help Greensburg businesses rank higher in Google and attract more local customers.",
    "Professional social media marketing services for small businesses in Greensburg PA. We manage your Facebook, Instagram, and LinkedIn to build your brand and engage customers.",
    "Google Ads and Facebook advertising management for Greensburg businesses. Our PPC campaigns deliver targeted leads and measurable ROI for small businesses in Western Pennsylvania."
  ],
  "instructions": [
    "1. Go to your Wix Editor",
    "2. Select your homepage",
    "3. Update the page title and meta description in SEO settings",
    "4. Replace the main heading with: TNR Business Solutions",
    "5. Update subheadings and content as needed"
  ]
}