[
  {
    "pageType": "Service Page",
    "pageId": "analytics-ai-enablement",
    "title": "Analytics & AI Enablement Greensburg PA | Dashboards & Insight",
    "mainHeading": "Transform Data Into Actionable Momentum",
    "description": "Analytics and AI enablement in Greensburg PA. Tracking architecture, GA4, dashboards, attribution modeling, data-informed experimentation, ethical AI augmentation.",
    "content": "Our analytics and AI enablement services help you transform raw data into actionable insights that drive business growth. We implement comprehensive tracking architecture, set up Google Analytics 4, create custom dashboards, and develop attribution models that give you a clear picture of your marketing performance. Our data-informed experimentation approach ensures every decision is backed by solid evidence, while our ethical AI augmentation helps you leverage artificial intelligence responsibly and effectively.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the analytics-ai-enablement page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Transform Data Into Actionable Momentum",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "branding-identity",
    "title": "Greensburg PA Branding Agency | Brand Strategy & Visual Identity",
    "mainHeading": "Build a Brand People Remember",
    "description": "Branding & visual identity services in Greensburg PA. Positioning, messaging, logo refinement, style systems, brand voice, and launch support to fuel growth.",
    "content": "Your brand is more than just a logo – it's the emotional connection your customers have with your business. Our branding and visual identity services help you create a memorable, cohesive brand that resonates with your target audience. We develop strategic positioning, craft compelling messaging, refine your logo and visual elements, and create comprehensive style systems that ensure consistency across all touchpoints.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the branding-identity page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Build a Brand People Remember",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "business-growth-consulting",
    "title": "Business Growth Consulting Greensburg PA | Strategy & Scaling",
    "mainHeading": "Align Strategy, Operations & Demand Generation",
    "description": "Business growth consulting in Greensburg PA. Offer design, pricing strategy, process optimization, marketing alignment, KPI dashboards, and risk-aware scaling.",
    "content": "Sustainable business growth requires alignment between strategy, operations, and demand generation. Our business growth consulting services help you design compelling offers, develop pricing strategies that maximize value, optimize your operational processes, and align your marketing efforts with your business objectives. We create KPI dashboards that track your progress and implement risk-aware scaling strategies that ensure long-term success.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the business-growth-consulting page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Align Strategy, Operations & Demand Generation",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "content-strategy-copywriting",
    "title": "Content Strategy & Copywriting Greensburg PA | Authority & Conversion",
    "mainHeading": "Build Topical Authority That Converts",
    "description": "Content strategy & copywriting in Greensburg PA. Pillar architecture, keyword clustering, persuasive copy, CRO messaging, and AI-assisted editorial workflows.",
    "content": "Content is the foundation of your digital presence and the key to building trust with your audience. Our content strategy and copywriting services help you build topical authority through pillar architecture and keyword clustering. We create persuasive copy that converts visitors into customers, develop CRO messaging that drives action, and implement AI-assisted editorial workflows that streamline your content production process.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the content-strategy-copywriting page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Build Topical Authority That Converts",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "email-marketing-automation",
    "title": "Email Marketing & Automation Greensburg PA | Lifecycle & CRM",
    "mainHeading": "Turn Your List Into a Compounding Revenue Asset",
    "description": "Email marketing & automation in Greensburg PA. Segmentation, nurture sequencing, behavioral triggers, lifecycle flows, deliverability, and revenue attribution.",
    "content": "Email marketing remains one of the most effective ways to nurture leads and drive sales. Our email marketing and automation services help you turn your email list into a compounding revenue asset. We implement advanced segmentation strategies, create nurture sequences that guide prospects through the buyer's journey, set up behavioral triggers that respond to user actions, and develop lifecycle flows that maximize customer lifetime value.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the email-marketing-automation page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Turn Your List Into a Compounding Revenue Asset",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "insurance-services",
    "title": "Insurance Advisory Greensburg PA | Personal & Commercial (No Health)",
    "mainHeading": "Integrated Advisory, Not Generic Policy Pushing",
    "description": "Insurance advisory in Greensburg PA. Personal and commercial coverage guidance (no health), risk assessment, policy review, bundling strategies, and protection optimization.",
    "content": "Insurance is about protection, not just policies. Our insurance advisory services provide integrated guidance that goes beyond generic policy recommendations. We conduct comprehensive risk assessments, review your existing coverage, develop bundling strategies that save you money, and optimize your protection to ensure you're covered where it matters most. We focus on personal and commercial coverage (excluding health insurance) to provide specialized expertise in the areas that matter most to your business.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the insurance-services page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Integrated Advisory, Not Generic Policy Pushing",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "paid-advertising",
    "title": "Paid Advertising Greensburg PA | Search, Social, Retargeting",
    "mainHeading": "Accelerate Qualified Demand (Without Wasting Budget)",
    "description": "Paid advertising management in Greensburg PA. ROI-first Google Ads, Meta Ads, retargeting, geofencing, landing pages, conversion tracking, and attribution.",
    "content": "Paid advertising can accelerate your growth when done right. Our paid advertising management services focus on ROI-first strategies that maximize your budget efficiency. We manage Google Ads campaigns that capture high-intent search traffic, create Meta Ads that engage your target audience, implement retargeting campaigns that bring back interested visitors, and use geofencing to reach local prospects. Every campaign is backed by conversion tracking and attribution analysis that proves its value.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the paid-advertising page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Accelerate Qualified Demand (Without Wasting Budget)",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "seo-services",
    "title": "Greensburg PA SEO Services | Local & Organic Search Growth",
    "mainHeading": "Grow Local Visibility & Qualified Leads",
    "description": "Local SEO & organic search services in Greensburg PA driving qualified traffic, rankings & leads. Technical SEO, Google Business Profile, content strategy, review acceleration.",
    "content": "Local SEO is essential for businesses serving specific geographic areas. Our SEO services help you grow your local visibility and attract qualified leads from organic search. We implement technical SEO improvements that make your site search-engine friendly, optimize your Google Business Profile to dominate local search results, develop content strategies that target relevant keywords, and accelerate your review acquisition to build trust and credibility with potential customers.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the seo-services page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Grow Local Visibility & Qualified Leads",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "social-media-marketing",
    "title": "Social Media Marketing Greensburg PA | Strategy & Management",
    "mainHeading": "Turn Social Into a Growth Engine",
    "description": "Social media marketing & management in Greensburg PA. Strategy, content pillars, multi-platform posting, engagement, paid boost, analytics, and funnel integration.",
    "content": "Social media is more than just posting – it's about building relationships and driving business results. Our social media marketing and management services help you turn social platforms into a growth engine. We develop comprehensive strategies, create content pillars that resonate with your audience, manage multi-platform posting schedules, engage with your community to build relationships, implement paid boost strategies that amplify your reach, and provide analytics that track your social media ROI.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the social-media-marketing page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Turn Social Into a Growth Engine",
      "5. Add the content and description as needed"
    ]
  },
  {
    "pageType": "Service Page",
    "pageId": "web-design",
    "title": "Greensburg PA Web Design | High-Converting Local Websites",
    "mainHeading": "Build a Website That Sells (Not Just Sits Online)",
    "description": "Conversion-focused web design & landing pages in Greensburg PA. Fast, mobile-first, SEO-ready builds with UX, CRO, analytics & brand alignment.",
    "content": "Your website is your digital storefront and often the first impression potential customers have of your business. Our conversion-focused web design services help you build a website that sells, not just sits online. We create fast, mobile-first designs that provide an excellent user experience, implement conversion rate optimization techniques that turn visitors into customers, ensure your site is SEO-ready to attract organic traffic, and align every element with your brand to create a cohesive, professional presence.",
    "lastUpdated": "2025-09-22T16:50:55.564Z",
    "instructions": [
      "1. Go to your Wix Editor",
      "2. Create or select the web-design page",
      "3. Update the page title and meta description in SEO settings",
      "4. Replace the main heading with: Build a Website That Sells (Not Just Sits Online)",
      "5. Add the content and description as needed"
    ]
  }
]